[
  "file-order",
  "obsidian-excalidraw-plugin",
  "oz-clear-unused-images",
  "file-explorer-note-count",
  "cmdr",
  "easy-typing-obsidian",
  "number-headings-obsidian",
  "obsidian-mind-map",
  "obsidian-image-toolkit",
  "mousewheel-image-zoom",
  "markdown-table-editor"
]