[
  "file-order",
  "obsidian-excalidraw-plugin",
  "oz-clear-unused-images",
  "file-explorer-note-count",
  "cmdr",
  "easy-typing-obsidian",
  "number-headings-obsidian",
  "obsidian-image-toolkit",
  "markdown-table-editor",
  "obsidian-linter"
]