[
  "file-order",
  "obsidian-excalidraw-plugin",
  "oz-clear-unused-images",
  "file-explorer-note-count",
  "cmdr",
  "number-headings-obsidian",
  "obsidian-image-toolkit",
  "obsidian-linter",
  "quickadd",
  "easy-typing-obsidian"
]